In [1]:
import pandas as pd

In [2]:
left = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                        'A':['A0', 'A1', 'A2', 'A3'],
                        'B':['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                        'C':['C0', 'C1', 'C2', 'C3'],
                        'D':['D0', 'D1', 'D2', 'D3']})

In [3]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [4]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

#### 6.1 直接合并
可以看到key直接合并了

In [5]:
pd.merge(left, right)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

#### 6.2 根据on参数来进行合并

In [6]:
pd.merge(left, right, on= 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

#### 6.3 根据多列进行合并

In [7]:
left = pd.DataFrame({'key1':['K0', 'K1', 'K2', 'K3'],
                     'key2':['K0', 'K1', 'K2', 'K3'],
                        'A':['A0', 'A1', 'A2', 'A3'],
                        'B':['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1':['K0', 'K1', 'K2', 'K3'],
                      'key2':['K0', 'K1', 'K2', 'K3'],
                        'C':['C0', 'C1', 'C2', 'C3'],
                        'D':['D0', 'D1', 'D2', 'D3']})

默认

In [8]:
pd.merge(left, right)

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A1  B1   K1   K1  C1  D1
2  A2  B2   K2   K2  C2  D2
3  A3  B3   K3   K3  C3  D3

指定某一列合并, 其他同名列会自动复制

In [9]:
pd.merge(left, right, on = 'key1')

    A   B key1 key2_x   C   D key2_y
0  A0  B0   K0     K0  C0  D0     K0
1  A1  B1   K1     K1  C1  D1     K1
2  A2  B2   K2     K2  C2  D2     K2
3  A3  B3   K3     K3  C3  D3     K3

指定多列

In [10]:
pd.merge(left, right, on = ['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A1  B1   K1   K1  C1  D1
2  A2  B2   K2   K2  C2  D2
3  A3  B3   K3   K3  C3  D3

#### 6.4 冲突处理

自动把哪些数据不一致的 key 给过滤掉(删掉有冲突的元素)

In [11]:
right["key2"][3] = "xxx"
pd.merge(left, right)

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A1  B1   K1   K1  C1  D1
2  A2  B2   K2   K2  C2  D2

#### 6.5 连接类型
* 主要包括inner（内连接）、outer（外链接）、left（左连接）、right（右连接）
* 参数how默认值是inner内连接，上面的都是采用内连接，连接两边都有的值
* 当采用outer外连接时，会取并集，并用NaN填充

In [12]:
pd.merge(left, right, how = 'outer')

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K1   K1   C1   D1
2   A2   B2   K2   K2   C2   D2
3   A3   B3   K3   K3  NaN  NaN
4  NaN  NaN   K3  xxx   C3   D3

左连接是左侧DataFrame取全部数据，右侧DataFrame匹配左侧DataFrame

In [13]:
pd.merge(left, right, how = 'left')

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K1   K1   C1   D1
2  A2  B2   K2   K2   C2   D2
3  A3  B3   K3   K3  NaN  NaN

indicator属性显示新数据是来自哪里

In [14]:
pd.merge(left, right, how = 'outer', indicator = True)

     A    B key1 key2    C    D      _merge
0   A0   B0   K0   K0   C0   D0        both
1   A1   B1   K1   K1   C1   D1        both
2   A2   B2   K2   K2   C2   D2        both
3   A3   B3   K3   K3  NaN  NaN   left_only
4  NaN  NaN   K3  xxx   C3   D3  right_only

### 显示设置

In [21]:
pd.get_option('display.max_rows')# 查看显示最大行数

60

In [22]:
pd.set_option('display.max_rows', 100)# 修改显示的最大行数

In [24]:
pd.get_option('display.max_colum')# 查看显示最大列数

20

In [26]:
pd.get_option('display.max_colwidth')# 字符串最大打印长度

50

In [28]:
pd.get_option('display.precision')# 小数精度精确位数

6

### 数据透视表

In [9]:
df=pd.read_csv('./data/titanic.csv')

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# 默认是求平均值
df.pivot_table(index = 'Sex', columns = 'Pclass', values = 'Fare')# 求不同性别在不同船舱等级的平均船票

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [13]:
# 也可以手动设置方法
df.pivot_table(index = 'Sex', columns = 'Pclass', values = 'Fare', aggfunc = 'max') # 求最大值

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

In [14]:
df.pivot_table(index = 'Sex', columns = 'Pclass', values = 'Fare', aggfunc = 'count') # 计数

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [15]:
pd.crosstab(index = df['Sex'], columns = df['Pclass'])

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [16]:
df.pivot_table(index = 'Pclass', columns = 'Sex', values = 'Survived', aggfunc = 'mean') # 查看获救情况

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [17]:
df['Underaged'] = df['Age'] <= 18

In [18]:
df.pivot_table(index='Underaged', columns='Sex', values='Survived')

Sex          female      male
Underaged
False      0.760163  0.167984
True       0.676471  0.338028